УТ_для_edt/src/Tasks/ЗадачаИсполнителя/ЗадачаИсполнителя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ЗадачаИсполнителя</name>
  <basedOn>Document.CRM_Интерес</basedOn>
  <basedOn>Document.ЗаказНаПеремещение</basedOn>
  <basedOn>Document.ЗаказНаСборку</basedOn>
  <basedOn>Document.смартЗаявкаНаРазборкуОборудования</basedOn>
  <basedOn>Document.смартЗаявкаНаРемонтныеРаботы</basedOn>
  <addressing>InformationRegister.ИсполнителиЗадач</addressing>
  <attributes>
    <name>Автор</name>
    <comment>Автор бизнес-процесса, который сформировал задачу</comment>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <comment>Для упорядочивания исполнителем своих задач по приоритету</comment>
    <type>
      <types>EnumRef.ВариантыВажностиЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаИсполнителейЗадач</name>
    <type>
      <types>CatalogRef.ГруппыИсполнителейЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсполнения</name>
    <comment>Дата и время фактического выполнения задачи</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <comment>Для упорядочивания исполнителем своих задач</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятияКИсполнению</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание постановки задачи для исполнителя</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <comment>Предмет задачи</comment>
    <type>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметСтрокой</name>
    <comment>Строковое представление предмета</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПринятаКИсполнению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВыполнения</name>
    <comment>Описание результата выполнения</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеБизнесПроцесса</name>
    <type>
      <types>EnumRef.СостоянияБизнесПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <comment>Плановый срок исполнения задачи</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ВариантВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ВариантВыполненияСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЗавершенДосрочно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Итерация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Личная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НачалоПереадресации</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Неудача</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОсновнаяКатегория</name>
    <type>
      <types>CatalogRef.CRM_КатегорииПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Переадресована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПеренестиСрокИсполненияНа</name>
    <comment>Служебный</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПоказатьАвтора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПоказатьДатуНачала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПоследнееДействиеСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПроцентВыполненияЗадачи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Родитель</name>
    <type>
      <types>TaskRef.ЗадачаИсполнителя</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СостояниеИнтереса</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СостояниеСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.CRM_ТочкиМаршрутов</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Этап</name>
    <type>
      <types>CatalogRef.CRM_ЭтапыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>смартВидЗадачи</name>
    <comment>//++ #1929 смарт: Фролов 22.07.2024 //Создание рабочего места сотрудника с Задачами/Взаимодействиями/Поручениями</comment>
    <type>
      <types>CatalogRef.смартВидыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>смартРучноеДобавление</name>
    <comment>//++ #1929 смарт: Фролов 22.07.2024 //Создание рабочего места сотрудника с Задачами/Взаимодействиями/Поручениями</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>CRM_Категории</name>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.CRM_КатегорииПользователей</types>
      </type>
    </attributes>
  </tabularSections>
  <addressingAttributes>
    <name>ДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>ОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

УТ_для_edt/src/Catalogs/CRM_КартыМаршрутов/CRM_КартыМаршрутов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_КартыМаршрутов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ЗапросНаИзменениеСроков</name>
      <description>Запрос на изменение сроков исполнения задачи</description>
    </items>
    <items>
      <name>Поручение</name>
      <description>Поручение</description>
    </items>
  </predefined>
  <attributes>
    <name>ГрафическаяСхема</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВИнтересах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Редактируется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсии</name>
    <comment>Номер текущей версии карты маршрута</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешеноДосрочноеЗавершение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеБизнесПроцессаВСодержаниеЗадачи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсторияБизнесПроцессаВСодержаниеЗадачи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактироватьСрокВыполненияЗадач</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактироватьДатуВыполненияЗадач</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьСрокВыполненияЭтапов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДинамическиРассчитыватьСрокиВыполненияЭтапов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПричинуНеудачногоЗавершения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПеремещатьТекущийЭтап</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтартоватьВФоновомРежимеИзДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПроцесса</name>
    <type>
      <types>EnumRef.bpmТипыПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>удалитьВидОбъекта</name>
    <type>
      <types>EnumRef.bpmВидыОбъектовПроцесса</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПроцесса</name>
    <type>
      <types>EnumRef.bpmСостояниеПроцесса</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриПринятииОбращения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбъектаСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитОбъектаСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РедактироватьИсполнителейЭтапов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СценарийИнтереса</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДосрочногоЗавершения</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДляБП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВерсииКартыМаршрута</name>
    <attributes>
      <name>КартаМаршрута</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВерсии</name>
      <comment>Номер данной версии</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСоздания</name>
      <comment>Дата создания версии</comment>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Tasks/ЗадачаИсполнителя/Forms/CRM_ФормаМоиЗадачи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем ТекстЗаголовкаФормы;
	
	Если НЕ CRM_ЛицензированиеСервер.ПодсистемаCRMИспользуется() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Невозможно открыть список задач. Подсистема 1С:CRM не используется! (см. Персональные настройки пользователя)'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	CRM_ЛицензированиеСервер.ПолучитьЗащищеннуюОбработку().ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	// +Этот блок обязательно должен быть в самом начале процедуры, чтобы при отказе не выполнять избыточный код.
	Если НЕ CRM_РежимФормЗакладкиСервер.ВосстановлениеФормыПриЗапускеСеанса(ЭтотОбъект, Отказ, СтандартнаяОбработка) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	// -Этот блок обязательно должен быть в самом начале процедуры, чтобы при отказе не выполнять избыточный код.
	
	МодульУправлениеДоступом = CRM_ОбщегоНазначенияСервер.ОбщийМодуль("CRM_УправлениеДоступом");
	Если МодульУправлениеДоступом <> Неопределено Тогда
		МодульУправлениеДоступом.ОграничитьВыводКлиентскойБазы(ЭтотОбъект, "Список");
	КонецЕсли;	
	
	Если Параметры.Свойство("ЗаголовокФормы", ТекстЗаголовкаФормы) И
		НЕ ПустаяСтрока(ТекстЗаголовкаФормы) Тогда
		Заголовок = ТекстЗаголовкаФормы;
		АвтоЗаголовок = Ложь;
		
	КонецЕсли;
	
	Если Параметры.Свойство("БлокировкаОкнаВладельца") Тогда
		РежимОткрытияОкна = Параметры.БлокировкаОкнаВладельца;
	КонецЕсли;
	
	// Оформление списка
	УстановитьОформлениеЗадач(Список.КомпоновщикНастроек.Настройки.УсловноеОформление);
	
	ИспользоватьДатуИВремяВСрокахЗадач = ПолучитьФункциональнуюОпцию("ИспользоватьДатуИВремяВСрокахЗадач");
	Элементы.ДатаНачала.Формат		= ?(ИспользоватьДатуИВремяВСрокахЗадач, "ДЛФ=DT", "ДЛФ=D");
	Элементы.СрокИсполнения.Формат	= ?(ИспользоватьДатуИВремяВСрокахЗадач, "ДЛФ=DT", "ДЛФ=D");
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ТекущееПодразделение = ТекущийПользователь.Подразделение;
	
	МоиПодразделения = CRM_УправлениеДоступомПовтИсп.ПолучитьПодразделенияВКоторыхРуководитель(ТекущийПользователь);
	Если МоиПодразделения.Количество() = 0 Тогда
		Элементы.ОтборПринадлежность.СписокВыбора.Удалить(Элементы.ОтборПринадлежность.СписокВыбора.НайтиПоЗначению("МоегоПодразделения"));
	КонецЕсли;
	Список.Параметры.УстановитьЗначениеПараметра("Исполнитель", ТекущийПользователь);
	Список.Параметры.УстановитьЗначениеПараметра("Подразделения", МоиПодразделения);
	Список.Параметры.УстановитьЗначениеПараметра("ПарамТекущаяДата", КонецДня(ТекущаяДатаСеанса()));
	Список.Параметры.УстановитьЗначениеПараметра("ПарамПустаяДата", Дата("00010101"));
	
	СписокСегодня.Параметры.УстановитьЗначениеПараметра("Исполнитель", ТекущийПользователь);
	СписокСегодня.Параметры.УстановитьЗначениеПараметра("ПарамТекущаяДата", КонецДня(ТекущаяДатаСеанса()));
	СписокСегодня.Параметры.УстановитьЗначениеПараметра("ПарамПустаяДата", Дата("00010101"));
	
	// Отборы
	Если НЕ ЗначениеЗаполнено(ОтборПринадлежность) Тогда
		ОтборПринадлежность = "Мои";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ОтборСтатус) Тогда
		ОтборСтатус = "Все";
	КонецЕсли;
	
	// Поле отображения содержания.
	CRM_ОбщегоНазначенияСервер.НастройкиПолейОтображенияСодержанияПриСозданииФормыСпискаНаСервере(ЭтотОбъект, , "ГруппаПолеОтображенияСодержания", "КнопкаПоказатьСкрытьПолеОтображенияСодержания");
	CRM_ОбщегоНазначенияСервер.НастройкиПолейОтображенияСодержанияПриСозданииФормыСпискаНаСервере(ЭтотОбъект, , "ГруппаПолеОтображенияСодержанияСегодня", "СписокСегодняПоказатьСкрытьПолеОтображенияСодержанияСегодня");
	
	// +Рабочий стол
	CRM_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	// -Рабочий стол
	// +Мобильный клиент
	Если НЕ CRM_ЛицензированиеЭкспортныеМетоды.ПодсистемаCRMИспользуется() Тогда
		УстановитьТолькоПросмотр = Истина;
	ИначеЕсли ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда		
		CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьЗащищеннуюОбработку(Истина, Истина).ПодготовитьФормуДляМобильногоКлиента(ЭтотОбъект);
	КонецЕсли;
	// -Мобильный клиент
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОтборПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗадачаВыполнена" ИЛИ ИмяСобытия = "ЗадачаИзменена" Тогда
		Элементы.Список.Обновить();
		Элементы.СписокСегодня.Обновить();
 	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЗавершениеРаботы Тогда Возврат; КонецЕсли;
	ПриЗакрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	CRM_РежимФормЗакладкиСервер.ПриЗакрытииНаСервере(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПолеОтображениеСодержанияПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	CRM_ОбщегоНазначенияКлиент.НастройкиПолейОтображенияСодержанияПолеСодержаниеПриНажатии(ДанныеСобытия, СтандартнаяОбработка,Новый ОписаниеТипов("ЗадачаСсылка.ЗадачаИсполнителя"));		

КонецПроцедуры

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
	Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Очистить();
	ОбновитьОтборыНаСервере(Список, ОтборПринадлежность, ОтборСтатус, ТекущийПользователь, ТекущееПодразделение);
	ТекущийЭлемент = Элементы.Список;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура ПриАктивизацииСтроки(Элемент)
	
	ИмяСписка = Элемент.Имя;
	Если Элементы[ИмяСписка].ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	ИмяПоля = "ПолеОтображениеСодержания" + СтрЗаменить(ИмяСписка, "Список", "");
	Если Элементы["ГруппаПолеОтображенияСодержания" + СтрЗаменить(ИмяСписка, "Список", "")].Видимость Тогда
		// Поле отображения содержания.
		Если НЕ Элементы[ИмяСписка].ТекущиеДанные.Свойство("ГруппировкаСтроки") И (ИмяСписка = "СписокСегодня" ИЛИ (ИмяСписка = "Список" И Элементы[ИмяСписка].ТекущиеДанные.Личная)) Тогда
			CRM_ОбщегоНазначенияКлиент.НастройкиПолейОтображенияСодержанияПриАктивизацииСтроки(ЭтотОбъект, Элементы[ИмяСписка].ТекущаяСтрока, Новый ОписаниеТипов("ЗадачаСсылка.ЗадачаИсполнителя"), , ИмяПоля);
		Иначе
			Попытка
				ЭтотОбъект[ИмяПоля] = CRM_БизнесПроцессыПереопределяемый.СформироватьОписаниеЗадачи(Элементы[ИмяСписка].ТекущаяСтрока);
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Элементы[ИмяСписка+"КонтекстноеМенюУстановитьПометкуУдаления"].Доступность	= НЕ Элементы[ИмяСписка].ТекущиеДанные.Свойство("ГруппировкаСтроки") И Элементы[ИмяСписка].ТекущиеДанные.Личная;
	
	Если НеобходимоДобавитьОбработчики И НЕ ОбработчикиДобавлены Тогда
		ДобавитьОбработчикиЭлементовГруппыБыстрыхНастроек(Неопределено);
	Иначе
		НеобходимоДобавитьОбработчики = Ложь;
		ОбработчикиДобавлены = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Очистить();
	ОбновитьОтборыНаСервере(Список, ОтборПринадлежность, ОтборСтатус, ТекущийПользователь, ТекущееПодразделение);
	НеобходимоДобавитьОбработчики = Истина;
	ОбработчикиДобавлены = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьСкрытьПолеОтображенияСодержания(Команда)
	CRM_ОбщегоНазначенияКлиент.НастройкиПолейОтображенияСодержанияПоказатьСкрытьПолеОтображенияСодержания(ЭтотОбъект, "ГруппаПолеОтображенияСодержания", "КнопкаПоказатьСкрытьПолеОтображенияСодержания");
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьПолеОтображенияСодержанияСегодня(Команда)
	CRM_ОбщегоНазначенияКлиент.НастройкиПолейОтображенияСодержанияПоказатьСкрытьПолеОтображенияСодержания(ЭтотОбъект, "ГруппаПолеОтображенияСодержанияСегодня", "СписокСегодняПоказатьСкрытьПолеОтображенияСодержанияСегодня");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЛичнуюЗадачу(Команда)
	ОткрытьФорму("Задача.ЗадачаИсполнителя.Форма.CRM_ФормаЛичнойЗадачи");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоручение(Команда)
	
	ДанныеЗаполнения = Новый Структура("Основание",ПредопределенноеЗначение("Справочник.CRM_КартыМаршрутов.Поручение"));
	ОткрытьФорму("БизнесПроцесс.CRM_БизнесПроцесс.Форма.ФормаПоручения", ДанныеЗаполнения, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьБизнесПроцесс(Команда)
	ОткрытьФорму("БизнесПроцесс.CRM_БизнесПроцесс.Форма.ФормаВыборИзДерева", , ЭтотОбъект, , ВариантОткрытияОкна.ОтдельноеОкно);
КонецПроцедуры

&НаКлиенте
Процедура ВосстанавливатьФормуПриОткрытии(Команда)
	Элементы.КнопкаВосстанавливатьФормуПриОткрытии.Пометка = НЕ Элементы.КнопкаВосстанавливатьФормуПриОткрытии.Пометка;
	CRM_ХранилищеНастроек.Сохранить(ЭтотОбъект.ИмяФормы, "ВосстанавливатьФормуПриОткрытии", Элементы.КнопкаВосстанавливатьФормуПриОткрытии.Пометка);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуУдаления(Команда)
	
	Если НЕ ТекущийЭлемент.ТекущиеДанные = Неопределено Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьПометкуУдаленияОтвет", ЭтотОбъект, Новый Структура("ТекущаяСтрока, ПометкаУдаления", ТекущийЭлемент.ТекущаяСтрока, Элементы.Список.ТекущиеДанные.ПометкаУдаления));
		Если ТекущийЭлемент.ТекущиеДанные.ПометкаУдаления Тогда
			ТекстВопроса = НСтр("ru='Снять с ""';en='Remove from ""'") + Строка(ТекущийЭлемент.ТекущаяСтрока) + НСтр("ru='"" пометку на удаление?'");
			
		Иначе
			ТекстВопроса = НСтр("ru='Пометить ""';en='Mark ""'") + Строка(ТекущийЭлемент.ТекущаяСтрока) + НСтр("ru='"" на удаление?'");
			
		КонецЕсли;
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуУдаленияОтвет(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		УстановитьПометкуНаСервере(ДополнительныеПараметры.ТекущаяСтрока, НЕ ДополнительныеПараметры.ПометкаУдаления);
	КонецЕсли;
	Элементы.Список.Обновить();
	Элементы.СписокСегодня.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	CRM_СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьОтборыНаСервере(Список, ОтборПринадлежность, ОтборСтатус, ТекущийПользователь, ТекущееПодразделение)
	тНастройки = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	Для Каждого ЭлементНастроек Из тНастройки Цикл
		Если ТипЗнч(ЭлементНастроек) = Тип("ОтборКомпоновкиДанных") Тогда
			тОтбор = ЭлементНастроек.Элементы;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ВыбранИсполнитель = Ложь;
	ВыбранАвтор = Ложь;
	ВыбранТекущееПодразделение = Ложь;
	ВыбранСрокИсполнения = Ложь;
	ВыбранВыполнена = Ложь;
	ВыбранПринятаКИсполнению = Ложь;
	
	Для Каждого ЭлементОтбора Из тОтбор Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИсполнительПотенциальный") И ЭлементОтбора.Использование Тогда
				ВыбранИсполнитель = Истина;
			ИначеЕсли ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Автор") И ЭлементОтбора.Использование Тогда
				ВыбранАвтор = Истина;
			ИначеЕсли ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИсполнительПотенциальный.ТекущееПодразделение") И ЭлементОтбора.Использование Тогда
				ВыбранТекущееПодразделение = Истина;
			ИначеЕсли ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СрокИсполнения") И ЭлементОтбора.Использование Тогда
				ВыбранСрокИсполнения = Истина;
			ИначеЕсли ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Выполнена") И ЭлементОтбора.Использование Тогда
				ВыбранВыполнена = Истина;
			ИначеЕсли ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПринятаКИсполнению") И ЭлементОтбора.Использование Тогда
				ВыбранПринятаКИсполнению = Истина;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
	Если ОтборПринадлежность = "Мои" И НЕ ВыбранИсполнитель Тогда
		CRM_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораСписка(Список, "ИсполнительПотенциальный", ТекущийПользователь); 
	ИначеЕсли ОтборПринадлежность = "Созданные" И НЕ ВыбранАвтор Тогда
		CRM_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Автор", ТекущийПользователь); 
	ИначеЕсли ОтборПринадлежность = "МоегоПодразделения" И НЕ ВыбранТекущееПодразделение Тогда
		CRM_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораСписка(Список, "ИсполнительПотенциальный", ИСТИНА); 
	КонецЕсли;
	
	Если ОтборСтатус = "Просроченные" Тогда
		Если НЕ ВыбранСрокИсполнения Тогда
			CRM_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораСписка(Список, "СрокИсполнения", '00010101', ВидСравненияКомпоновкиДанных.НеРавно); 
			CRM_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораСписка(Список, "СрокИсполнения", НачалоДня(CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса()), ВидСравненияКомпоновкиДанных.Меньше); 
		КонецЕсли;
		Если НЕ ВыбранВыполнена Тогда
			CRM_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Выполнена", Ложь); 
		КонецЕсли;
	ИначеЕсли ОтборСтатус = "ВРаботе" Тогда
		
		// Отбор составной, поэтому разные условия распределяем по группам отбора.
		ОбщаяГруппаОтбора	= CRM_ОбщегоНазначенияКлиентСервер.УстановитьГруппуОтбораСписка(Список, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		ГруппаИ1			= CRM_ОбщегоНазначенияКлиентСервер.УстановитьГруппуОтбораСписка(Список, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ,ОбщаяГруппаОтбора); 
		ГруппаИ2			= CRM_ОбщегоНазначенияКлиентСервер.УстановитьГруппуОтбораСписка(Список, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ,ОбщаяГруппаОтбора); 		
		Если НЕ ВыбранПринятаКИсполнению Тогда
			CRM_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораСписка(Список, "ПринятаКИсполнению", Истина, , ГруппаИ1); 
			CRM_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораСписка(Список, "ПринятаКИсполнению", Ложь, , ГруппаИ2); 			
		КонецЕсли;
		Если НЕ ВыбранВыполнена Тогда
			CRM_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Выполнена", Ложь,,ГруппаИ1); 
			CRM_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Выполнена", Ложь,,ГруппаИ2); 			
		КонецЕсли;
		Если НЕ ВыбранСрокИсполнения Тогда
			CRM_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораСписка(Список, "СрокИсполнения", НачалоДня(CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса()), ВидСравненияКомпоновкиДанных.БольшеИлиРавно, ГруппаИ2); 
			CRM_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораСписка(Список, "СрокИсполнения", '00010101', ВидСравненияКомпоновкиДанных.НеРавно, ГруппаИ2); 			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОбработчикиЭлементовГруппыБыстрыхНастроек(Элемент)
	Если Элемент = Неопределено Тогда 
		Элемент = Элементы.СписокКомпоновщикНастроекПользовательскиеНастройки;
	КонецЕсли;
	Для Каждого тЭлемент Из Элемент.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(тЭлемент) = Тип("ГруппаФормы") Тогда
			ДобавитьОбработчикиЭлементовГруппыБыстрыхНастроек(тЭлемент);
		Иначе
			тЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииЭлементаГруппыБыстрыхНастроек"); 
		КонецЕсли;
	КонецЦикла;
	ОбработчикиДобавлены = Истина;
	Если Элемент = Элементы.СписокКомпоновщикНастроекПользовательскиеНастройки Тогда
		Элемент = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииЭлементаГруппыБыстрыхНастроек(Элемент)
	ОтборПриИзменении(Неопределено);
КонецПроцедуры

&НаСервере
Процедура УстановитьПометкуНаСервере(Задача, Флаг)
	
	ЗадачаОбъект = Задача.ПолучитьОбъект();
	ЗадачаОбъект.УстановитьПометкуУдаления(Флаг);
	
КонецПроцедуры

// +Рабочий стол
#Область Подключаемый_РабочийСтол

&НаКлиенте
Процедура Подключаемый_ПолеHTMLНапоминанийПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	CRM_РабочийСтолКлиент.ПолеHTMLНапоминанийПриНажатии(ЭтаФорма, Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры // Подключаемый_ПолеHTMLНапоминанийПриНажатии()

&НаКлиенте
Процедура Подключаемый_ПолеHTMLЗаметокПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	CRM_РабочийСтолКлиент.ПолеHTMLЗаметокПриНажатии(ЭтаФорма, Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры // Подключаемый_ПолеHTMLЗаметокПриНажатии()

#КонецОбласти
// -Рабочий стол

&НаСервере
Процедура УстановитьОформлениеЗадач(УсловноеОформление)
	
	// Установка оформления для просроченных задач.
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СрокИсполнения");
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОсталосьДней");
	
	ЭлементОтбораДанных = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Просрочена");
	ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораДанных.ПравоеЗначение = 0;
	ЭлементОтбораДанных.Использование = Истина;
	
	ЭлементЦветаОформления = ЭлементУсловногоОформления.Оформление.Элементы.Найти("TextColor");
	ЭлементЦветаОформления.Значение =  Метаданные.ЭлементыСтиля.ПросроченныеДанныеЦвет.Значение;   
	ЭлементЦветаОформления.Использование = Истина;
	
	// Установка оформления для важных задач.
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбораДанных = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Важность");
	ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораДанных.ПравоеЗначение = Перечисления.ВариантыВажностиЗадачи.Высокая;
	ЭлементОтбораДанных.Использование = Истина;
	
	ЭлементЦветаОформления = ЭлементУсловногоОформления.Оформление.Элементы.Найти("Font");
	ЭлементЦветаОформления.Значение =  Метаданные.ЭлементыСтиля.НеПринятыеКИсполнениюЗадачи.Значение;
	ЭлементЦветаОформления.Использование = Истина;
	
	// Установка оформления для принятых задач.
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбораДанных = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПринятаКИсполнению");
	ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораДанных.ПравоеЗначение = Ложь;
	ЭлементОтбораДанных.Использование = Истина;
	
	ЭлементЦветаОформления = ЭлементУсловногоОформления.Оформление.Элементы.Найти("ЦветФона");
	ЭлементЦветаОформления.Значение =  Новый Цвет(255,252,218);
	ЭлементЦветаОформления.Использование = Истина;
	
	ЭлементЦветаОформления = ЭлементУсловногоОформления.Оформление.Элементы.Найти("TextColor");
	ЭлементЦветаОформления.Значение = Новый Цвет(105,72,47);
	ЭлементЦветаОформления.Использование = Истина;
	
	// Установка оформления для выполненных задач.
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбораДанных = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Выполнена");
	ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораДанных.ПравоеЗначение = Истина;
	ЭлементОтбораДанных.Использование = Истина;
	
	ЭлементЦветаОформления = ЭлементУсловногоОформления.Оформление.Элементы.Найти("ЦветФона");
	ЭлементЦветаОформления.Значение =  Новый Цвет(245,251,247);
	ЭлементЦветаОформления.Использование = Истина;
	
	ЭлементЦветаОформления = ЭлементУсловногоОформления.Оформление.Элементы.Найти("TextColor");
	ЭлементЦветаОформления.Значение = Новый Цвет(104,144,87);
	ЭлементЦветаОформления.Использование = Истина;

КонецПроцедуры

#КонецОбласти
